#pragma once
#include<d3d12.h>
#include<wrl/client.h>

//@brief	/=== コマンドキュークラス ===/
class CommandQueue final
{
public:
	//----------------------------------------------------------------------------------------------------

	//@brief	=== コマンドキュー初期化関数 ===
	//@return	キューの作成の成否
	[[nodiscard]] bool initialize_queue(D3D12_COMMAND_LIST_TYPE type);


	//@brief	=== コマンドキュー取得関数 ===
	//@return	コマンドキューポインター
	[[nodiscard]] ID3D12CommandQueue* get_queue()const noexcept;

	//----------------------------------------------------------------------------------------------------
private:
	//----------------------------------------------------------------------------------------------------

	Microsoft::WRL::ComPtr<ID3D12CommandQueue> queue_{};	//Queue

	//----------------------------------------------------------------------------------------------------
};